tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/tex"
tap "homebrew/versions"
brew "bash-completion"
brew "ccze"
brew "cli53"
brew "cmark"
brew "colordiff"
brew "coreutils"
brew "exiftool"
brew "fdupes"
brew "webp"
brew "git"
brew "pygobject3"
brew "git-annex"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grep"
brew "handbrake"
brew "htop"
brew "hub"
brew "hugo"
brew "keychain"
brew "liblockfile"
brew "lzop"
brew "mas"
brew "midnight-commander"
brew "mkvtoolnix"
brew "mono"
brew "mosh"
brew "mosquitto", restart_service: true
brew "mr"
brew "mutt"
brew "muttils"
brew "node"
brew "openssl@1.1"
brew "paperkey"
brew "parallel"
brew "pv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "rclone"
brew "rcs"
brew "restic"
brew "rmlint"
brew "s3cmd"
brew "scons"
brew "shellcheck"
brew "sphinx-doc"
brew "ssh-copy-id"
brew "telnet"
brew "tree"
brew "vcsh"
brew "vim"
brew "wget"
brew "wine"
brew "winetricks"
brew "youtube-dl"
brew "zopfli"
cask "alfred"
cask "appcleaner"
cask "arq"
cask "bartender"
cask "caffeine"
cask "ctivo"
cask "darktable"
cask "devonthink-pro-office"
cask "dropbox"
cask "google-chrome"
cask "hazel"
cask "inkscape"
cask "iterm2"
cask "java"
cask "keybase"
cask "keyboard-maestro"
cask "nvalt"
cask "openzfs"
cask "osxfuse"
cask "rowanj-gitx"
cask "superduper"
cask "vlc"
cask "xquartz"
mas "", id: 568494494
mas "", id: 409183694
mas "", id: 1107421413
mas "", id: 403504866
mas "", id: 419330170
mas "", id: 571213070
mas "", id: 510620098
mas "", id: 682658836
mas "", id: 446107677
mas "", id: 407963104
mas "", id: 443987910
mas "", id: 467939042
mas "", id: 1153157709
mas "", id: 409203825
mas "", id: 497799835
mas "", id: 1055273043
mas "", id: 409201541
mas "", id: 442168834
mas "", id: 408981434
mas "", id: 1176895641
mas "", id: 803453959
mas "", id: 413969927
mas "", id: 472790630
mas "", id: 720669838
